[
  {
    "title": "Stop Using JS for That",
    "person": "Kilian Valkhof",
    "category": "speaker",
    "reflection": "Ik vond deze weekly nerd erg interessant, omdat er sommige dingen voorbij kwamen die ik nog niet wist dat je HTML en CSS kon gebruiken in plaats van JavaScript. Ook vond ik 'the rule of least power' erg interessant, omdat ik dit nog niet eerder had gehoord. Het is een goede tip om te onthouden dat je de browser meer zelf moet laten regelen.",
    "content": "In de presentatie “Stop Using JS for That” laat Kilian Valkhof zien dat je tegenwoordig veel dingen die je normaal met JavaScript zou doen, ook gewoon met HTML en CSS kunt maken. Denk aan dingen als accordeons, popups en switches. Hij zegt: gebruik de simpelste oplossing die werkt — vaak is dat dus niet JS. Met HTML en CSS laat je de browser meer zelf regelen, wat vaak beter werkt én minder snel stukgaat. Hij liet live voorbeelden zien van checkboxes, de <details> tag voor accordeons, en <dialog> voor modals, allemaal zonder of met heel weinig JavaScript. Ook nieuwe CSS dingen zoals :has(), focus-visible en @starting-style kwamen voorbij.",
    "image": "https://pbs.twimg.com/profile_images/1181285099813388288/BqrzE9gF_400x400.jpg",
    "company": "Polypane",
    "slug": "../weekly-nerd/#kilian-valkhof"
  },
  {
    "title": "Pay the Web Forward",
    "person": "Peter-Paul Koch",
    "category": "speaker",
    "reflection": "Web Monetization is een uniek concept, maar ik ben van mening dat dit niet de toekomst is. Het idee dat je x bedrag per maand betaalt voor een website is niet iets wat ik zie gebeuren. Dit is omdat het misschien voor developers leuk is om zo iets te maken, maar voor de gemiddelde gebruiker is dit niet iets wat ze willen. Ik heb hierover gesproken ook met non-developers en zij gaven aan dat ze simpelweg niet de website zouden gebruiken.",
    "content": "In “Pay the Web Forward” pleit Peter-Paul Koch voor een alternatief verdienmodel op het web, namelijk Web Monetization. Hij legt uit dat het huidige systeem — waarbij alles gratis is en gefinancierd wordt via advertenties — ontstaan is uit gewoonte en slechte beslissingen in de jaren '90. Daardoor is content nu vaak gericht op clicks in plaats van kwaliteit. Web Monetization draait het om: gebruikers kunnen vrijwillig betalen aan sites die ze echt waarderen, gebaseerd op hoe lang ze er blijven. Dit stimuleert betere content in plaats van clickbait. Je hebt hiervoor een wallet nodig, een browserextensie, en je bepaalt zelf hoeveel je per uur of per maand wilt besteden.",
    "image": "https://i.ytimg.com/vi/3Wgm4sq0pn0/maxresdefault.jpg",
    "company": "Web Monetization",
    "slug": "../weekly-nerd/#peter-paul-koch"
  },
  {
    "title": "GSAP",
    "person": "Cassie Evans",
    "category": "speaker",
    "reflection": "Ik was helaas ziek tijdens deze weekly nerd, maar ik heb zelf wat research gedaan en de slides bekeken en ik was altijd al een fan van GSAP, maar ik werd nog steeds verbaast door de mogelijkheden die er zijn. Vooral de timelines die je kan maken zijn erg handig en ik zal GSAP zeker blijven gebruiken voor het maken van animaties.",
    "content": "GSAP (GreenSock Animation Platform) is een krachtige JavaScript-animatiebibliotheek waarmee je heel vloeiende en complexe animaties kunt maken. Het werkt op vrijwel alles wat je op een webpagina kunt animeren: DOM-elementen, SVG's, canvas, zelfs WebGL. GSAP is supersnel, werkt goed in alle moderne browsers en is makkelijk te gebruiken met simpele code. Bijvoorbeeld: gsap.to('.box', { x: 100, duration: 1 }) — en je hebt al een animatie. Het ondersteunt ook timelines, waarmee je meerdere animaties precies na elkaar of tegelijk kunt laten gebeuren.",
    "image": "https://pixelpioneers.co/imager/pioneers/1204/cassie_evans_ad3aa96fd14ad17c252000c804266ea7.png",
    "company": "GSAP",
    "slug": "../weekly-nerd/#cassie-evans"
  },
  {
    "title": "Declarative Design",
    "person": "Jeremy Keith",
    "category": "speaker",
    "reflection": "Ik heb met Jeremy Keith gesproken en vooral een ding wat hij tegen me zei is iets waar ik altijd rekening mee zal houden. Dit is dat je eigenlijk alle elementen die met JavaScript beinvloed worden (Dus bijvoorbeeld display: none), die moeten standaard zichtbaar zijn in de HTML en CSS en met JavaScript verborgen worden, want zo zorg je ervoor dat als JavaScript niet werkt dat de website nog steeds goed te gebruiken is. Dit is iets wat ik nog niet eerder had gehoord, maar ik vind het een hele goede tip.",
    "content": "In “Declarative Design” legt Jeremy Keith het verschil uit tussen imperatief en declaratief programmeren. Bij imperatief geef je de computer strikte instructies (zoals met JavaScript), terwijl je bij declaratief vooral beschrijft wat je wil bereiken (zoals met HTML of CSS). HTML is fouttolerant en blijft werken, ook als er iets niet klopt — JavaScript niet. Daarom zegt Jeremy: “JavaScript should only do what only JavaScript can do.” Hij benadrukt dat we de browser niet moeten micromanagen, maar begeleiden. Denk dus in systemen, gebruik tools zoals clamp(), REM en sites als utopia.fyi om flexibele en schaalbare designs te maken.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Jeremy_Keith_in_2019.jpg",
    "company": "Clearleft",
    "slug": "../weekly-nerd/#jeremy-keith"
  },
  {
    "title": "Hackers United",
    "person": "Rosa",
    "category": "speaker",
    "reflection": "Ik snapte eerlijk gezegd niet helemaal hoe deze weekly nerd relevant was voor waar wij mee bezig zijn. Ik heb eerlijk gezegd niet veel van haar verhaal opgestoken en ik heb ook niet het idee dat ik hierdoor een betere developer ben geworden.",
    "content": "In “Hackers United” deelt Rosa haar visie op wat het betekent om een hacker te zijn — en dat is iets heel anders dan het stereotype van iemand die computers kraakt. Voor haar draait hacken om creativiteit, nieuwsgierigheid en zelf dingen uitproberen: het DIY-ethos. Ze werkt met e-waste en oude apparaten en laat zien dat je met simpele tools, zoals ImageMagick via de terminal, toffe dingen kunt maken, zoals posters. Ze benadrukt dat je niet afhankelijk moet zijn van één tool of platform, maar meerdere opties moet kennen. Rosa moedigt aan om te leren door te proberen, zelfs als iets ingewikkeld is — zoals werken met Bash.",
    "image": "https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460_960_720.png",
    "company": "?",
    "slug": "../weekly-nerd/#rosa"
  },
  {
    "title": "Geld verdienen met Project Fugu",
    "person": "Niels Leenheer",
    "category": "speaker",
    "reflection": "Het was interessant om te zien hoeveel er tegenwoordig mogelijk is met PWA's. Eerst waren er veel voordelen aan het maken van een native app, maar tegenwoordig zijn er dus blijkbaar al super veel manieren om een PWA te maken die net zo goed werkt als een native app. Dit was erg interessant om te zien en ook motivereed om beter als web developer te worden.",
    "content": "In “Geld verdienen met Project Fugu” vertelt Niels Leenheer hoe hij met webtechnologie een volledig kassasysteem heeft gebouwd, vooral voor kapsalons via zijn platform Salonhub. Waar hij vroeger native apps gebruikte, maakt hij nu alles als PWA (Progressive Web App). Dankzij Project Fugu — een initiatief van Google om PWA's krachtiger te maken — kan hij bijvoorbeeld via WebUSB en WebSerial communiceren met bonnenprinters, klantendisplays en barcodescanners. Hij heeft hiervoor zelfs eigen JavaScript-libraries geschreven zoals EscPosEncoder en WebSerialCustomerDisplay om apparaten aan te sturen via het web.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQS4digmKfjea4m1AsVh1tYoi9anJFeOPiZdAaN3jjsv-pP1Gj8uxnvANb4TTCgeCnHJQ&usqp=CAU",
    "company": "?",
    "slug": "../weekly-nerd/#niels-leenheer"
  },
  {
    "title": "Practical fixes for common WCAG issues",
    "person": "Erik Kroes",
    "category": "speaker",
    "reflection": "Erik noemde een aantal interessante punten op waar je rekening mee moet houden als je een website maakt. Ik zelf wist al redelijk veel van de dingen die hij vertelde, vooral denk ik omdat we op CMD veel met toegankelijkheid bezig zijn, maar sommige dingen zoals bijna nooit placeholders gebruiken waren wel interessant.",
    "content": "In “Practical fixes for common WCAG issues” legt Erik Kroes uit wat toegankelijkheid (a11y) echt inhoudt: zorgen dat je product bruikbaar is voor iedereen, ook voor mensen met een beperking. Hij behandelt vier belangrijke onderdelen: toetsenbordnavigatie, contrast, alternatieven (zoals alt-tekst en ondertiteling) en responsive design. Een toegankelijke site hoeft niet perfect te zijn, maar moet technisch gewoon werken. Hij geeft concrete voorbeelden van veelvoorkomende fouten, zoals het vergeten van skip-links, slecht contrast bij tekst of knoppen, of het gebruik van niet-semantische HTML zoals <div role='button'>.",
    "image": "https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460_960_720.png",
    "company": "?",
    "slug": "../weekly-nerd/#erik-kroes"
  },
  {
    "title": "Thinking outside of the accessibility box",
    "person": "Nienke Keijzer",
    "category": "speaker",
    "reflection": "Eigenlijk werd hier een beetje herhaald wat Erik Kroes ook al had verteld, maar dan iets meer haar persoonlijke ervaring met het werkt dat ze heeft gedaan voor GVB als haar afstudeerproject (En nu haar baan). Het was interessant om te horen dat de beste test eigenlijk gewoon is om te praten met de doelgroep waarom het gaat.",
    "content": "In “Thinking outside of the accessibility box” vertelt Nienke de Keijzer over haar ervaring met toegankelijkheid, vooral in haar werk bij GVB (het openbaar vervoer in Amsterdam). Ze wijst erop dat er veel regels zijn zoals WCAG, EU-wetgeving en nieuwe Nederlandse wetten, maar dat ze het meest leert door gewoon met mensen te praten. In haar onderzoek liep ze tegen uitdagingen aan zoals kleine testgroepen of te technische tests, maar juist door echt contact met gebruikers vond ze waardevolle inzichten. Bij GVB werkte ze aan ReisAssist, een visuele modus speciaal voor mensen met een visuele beperking.",
    "image": "https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460_960_720.png",
    "company": "GVB",
    "slug": "../weekly-nerd/#nienke-keijzer"
  },
  {
    "title": "The rise of AI-powered Voice Interfaces on the web",
    "person": "Dave Bitter",
    "category": "speaker",
    "reflection": "Ik vond het erg interessant om te zien hoe spraakherkenning beter is geworden en hoe lang het eigenlijk al bestaat en hoe je deze tegenwoordig kan gebruiken om een conversatie met spraak te voeren op websites. Ik denk dat dit iets zou kunnen zijn dat op bepaalde websites handig zou kunnen zijn, zoals bij een klantenservice. Ik denk alleen niet dat dit de toekomst zal zijn van het web en ik denk ook dat de voorkeur voor klantenservice altijd uit zal gaan naar een mens.",
    "content": "Dave Bitter liet zien hoe je AI-gestuurde voice interfaces kunt bouwen voor het web. Hij maakte zelf een webapp die live luistert naar wat je zegt en dit direct op het scherm toont. Dit is mogelijk dankzij spraakherkenning, iets dat al sinds de jaren ’50 bestaat, maar pas echt bruikbaar werd in de jaren ’90 (denk aan spraakgestuurde telefoonsystemen) en daarna verder verbeterde door Google, Alexa en andere assistenten. Zijn punt: praten is een natuurlijkere manier van communiceren dan typen, dus waarom gebruiken we dat niet meer online? Wat je nodig hebt: useSpeechRecognition: om te luisteren, ChatGPT API: om de input te verwerken, useSpeechSynthesis: om te antwoorden met spraak. Om AI een persoonlijkheid te geven, voegde hij animaties toe (bijv. “luisteren” of “antwoorden”), en gebruikte hij AI-gegenereerde stemmen die realistischer klinken, al zorgen die soms voor vertraging. Belangrijkste les: prestaties zijn belangrijker dan fancy features. Bouw gewoon iets, ga niet alleen maar praten over ideeën.",
    "image": "https://www.davebitter.com/img/talks/remix-party.jpg",
    "company": "iO Digital",
    "slug": "../weekly-nerd/#dave-bitter"
  },
  {
    "title": "Twitter Follow Bot and Follower Scraper",
    "person": "Steve Jonk",
    "category": "speaker",
    "reflection": "Hoewel ik dit een erg interessante weekly nerd vond en de techniek erachter erg interessant was, sta ik hier ethisch gezien niet achter. Ik vind de opdracht zelf onethischer dan het breken van de TOS van Twitter en ik zou dit zelf nooit doen.",
    "content": "Steve Jonk maakte een Twitter-bot die automatisch volgers van een ander account verzamelt en volgt. Omdat de Twitter API dit niet goed ondersteunt zonder dure toegang, gebruikte hij creatieve oplossingen zoals N8N voor workflow-automatisering, Puppeteer voor browser-automatisering en PostgreSQL voor het opslaan van gegevens. Door het gedrag van een echte gebruiker na te bootsen met willekeurige pauzes en acties, wist hij de beperkingen van Twitter te omzeilen. Het resultaat was een volledig dashboard waarin dit proces te volgen is.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTXKOj6Ill2zfpb1mtEzC1_eXbI5EctOxdQcA&s",
    "company": "iO Digital",
    "slug": "../weekly-nerd/#steve-jonk"
  },
  {
    "title": "How do you automate testing your components like a real user?",
    "person": "Clarke Verdel",
    "category": "speaker",
    "reflection": "Ik vond dit een erg interessante weekly nerd, waar het belang van goed testen werd laten zien. Het was erg handig om ook verschillende manieren te zien waarop je kan testen om zo te zorgen dat er op de website geen bugs zitten. Dit kan vooral voor grote bedrijven veel geld kosten en wil je dus zeker niet laten gebeuren.",
    "content": "Clarke Verdel werkt bij Miele aan het internationale e-commerceplatform en is een T-shaped engineer die naast front-end ook testing en DevOps doet. Ze gebruiken een eigen design system genaamd MieleAutocomplete. Zijn werkwijze is gebaseerd op de Testing Trophy: van static tooling met ESLint en TypeScript, naar unit- en componenttests, integratietests, tot aan E2E-tests die in de browser draaien. De uitdaging zit vooral in het waarborgen van zaken als responsiveness, toegankelijkheid, performance, browsercompatibiliteit, dark/light mode, animaties, SEO en multi-tenancy. Om vertrouwen in de code te krijgen worden tests gedaan op verschillende niveaus: van gesimuleerde omgevingen tot real-world browser testing met tools zoals Vitest, Cypress en Playwright.",
    "image": "https://media.licdn.com/dms/image/v2/D4E03AQEJA0zMYr1QQg/profile-displayphoto-shrink_400_400/B4EZTVDv9fHUAk-/0/1738741318071?e=1755129600&v=beta&t=BNeUMkIeNjPtes4KjAllRDzEK9kv9WZoQGofcjKhRDo",
    "company": "iO Digital",
    "slug": "../weekly-nerd/#clarke-verdel"
  },
  {
    "title": "Q42 (A11Y)",
    "person": "Johan Huijkman",
    "category": "speaker",
    "reflection": "Wat ik cool vond van Q42 is dat zij A11Y niet als bijzaak zien, maar als een essentieel onderdeel van hun werk. Ik vind het tof dat ze bij alles wat ze maken vanaf het begin al zorgen dat deze toegankelijk is en dat niet als bijzaak zien. Ook zijn de 4 vragen die je kan stellen voor toegankelijkheid erg waardevol en goed om mee te nemen.",
    "content": "Q42 is een digitaal bureau dat sinds 2000 innovatieve producten ontwikkelt met een sterke focus op toegankelijkheid, eindgebruikers en technische vernieuwing. Ze werken voor bekende klanten zoals HEMA, het Rijksmuseum en Philips Hue, en zijn sinds 2022 onderdeel van Eidra, samen met bijvoorbeeld Fabrique. Binnen Q42 wordt er veel geëxperimenteerd met nieuwe ideeën via initiatieven als W00tcamp, passiedagen, jumpstarts en bedenkdagjes. Toegankelijkheid (a11y) is een essentieel onderdeel van hun DNA, mede door de aankomende European Accessibility Act die vanaf juni 2025 verplicht wordt. Daarbij stellen ze vier kernvragen om inclusiviteit te waarborgen: wat als iemand niet goed kan zien, horen, bewegen of begrijpen?",
    "image": "https://webdevcon.nl/wp-content/uploads/2022/04/Johan-Huijkman.jpeg",
    "company": "Q42",
    "slug": "../weekly-nerd/#johan-huijkman"
  },
  {
    "title": "Q42 (A11Y)",
    "person": "Marvin Sernee",
    "category": "speaker",
    "reflection": "Wat ik vooral interessant vond was micr.io, de technologie die Q42 heeft ontwikkeld om afbeeldingen extreem goed in te zoomen. Dit is iets wat ik nog niet eerder had gezien en ik was erg onder de indruk van hoe goed de kwaliteit was van een afbeelding als er ver werd ingezoomd. Daarnaast vond ik de projecten ook erg uniek en interessant.",
    "content": "Q42 presenteerde twee bijzondere projecten. Het eerste project, SenseMath, is ontwikkeld in samenwerking met expertisecentrum Visio en richt zich op blinde leerlingen. Door grafieken hoorbaar te maken met verschillende soorten geluiden, waaronder een speciaal aangepast pianogeluid, kunnen blinde gebruikers wiskundige grafieken interpreteren. De app bevat een speciaal ontwikkeld toetsenbord, touch typing functionaliteit en toegang tot bijna alle wiskundeboeken via ISBN. Het tweede project, Oculi Mundi, is een interactieve 3D-ervaring van een historische kaartencollectie, gemaakt met alleen HTML en CSS om toegankelijkheid te waarborgen. De kaarten zijn extreem goed in te zoomen dankzij Q42’s eigen beeldtechnologie Micr.io.",
    "image": "https://cdn.theorg.com/01de335f-b34b-4140-8bc4-43d916771ffb_medium.jpg",
    "company": "Q42",
    "slug": "../weekly-nerd/#marvin-sernee"
  },
  {
    "title": "Digitaal toegankelijkheid in de praktijk",
    "person": "Marieke de Hoop",
    "category": "speaker",
    "reflection": "Ik vond dit de interessantste A11Y weekly nerd, omdat hier echt werd gesproken over de praktijk van toegankelijkheid. Ook was het handig om meer details te krijgen over de EAA en het was ook goed om stil te staan bij het aantal mensen die eigenlijk toch een beperking hebben. Daarnaast waren de genoemde tools ook erg handig en ik zal die zeker opslaan om te gaan gebruiken.",
    "content": "Toegankelijkheid is essentieel: meer dan 32% van de Nederlanders heeft een permanente beperking, en bijna iedereen ervaart tijdelijk of situationeel beperkingen. Toegankelijk ontwerpen is dus niet voor een niche, maar voor iedereen. In de toegankelijkheidsbranche werken bedrijven zoals Digitaal Toegankelijk, Cardan en Swink aan audits, advies, trainingen en het ontwikkelen van toegankelijke producten. Het werk bestaat uit testen (zoals met Stylus of kleurcontrastcheckers), adviseren en lesgeven. Met de komst van de European Accessibility Act (EAA) zijn er nu ook stevige wettelijke verplichtingen. Deze wet geldt vanaf 28 juni 2025 voor nieuwe digitale producten en diensten in de EU en wordt gehandhaafd door verschillende overheidsinstanties. Niet voldoen aan deze wet kan leiden tot boetes tot 20 miljoen euro of 10% van de omzet.",
    "image": "https://media.licdn.com/dms/image/v2/D4E03AQHSR35GAGzD1g/profile-displayphoto-shrink_200_200/B4EZZ9BSLqHoAY-/0/1745854211358?e=1755734400&v=beta&t=pRtelwyr_RuSCWRl1-D-wm_P0sdOIiM0O3ht5j2XlKw",
    "company": "Digitaal Toegankelijk",
    "slug": "../weekly-nerd/#marieke-de-hoop"
  },
  {
    "title": "Unwrapping web design",
    "person": "Nils Binder",
    "category": "speaker",
    "reflection": "Ik vond deze weekly nerd erg interessant en ik heb toevallig laatst een opdracht moeten maken waar zo een max-width nodig was, maar nu heb ik dus de nieuwere en betere manier geleerd om zo een layout te maken. Ik vond het ook erg fijn dat hij echt code voorbeeld liet zien, zodat ik makkelijk kan terug vinden hoe het ook alweer werkt in mijn notities. Ik vond dit een van de meest interessante weekly nerds.",
    "content": "Tijdens Pre-CSS Day werd het concept van wrappers opnieuw bekeken. De traditionele manier van centreren met vaste marges en paddings werd vergeleken met moderne CSS-technieken zoals min() en margin-inline. Deze nieuwe methodes bieden meer flexibiliteit, bijvoorbeeld met een geavanceerde variant die gebruikmaakt van max() en CSS-variabelen voor dynamische marges. Ook werd benadrukt dat ontwerpers zich niet moeten beperken tot conventies of tools als Figma, ChatGPT en Tailwind de 'triangle of boredom' maar juist bewust moeten omgaan met whitespace en layout. De website dasruhrgebiet.de werd als voorbeeld genoemd van creatief gebruik van optionele gridkolommen.",
    "image": "https://9elements.com/blog/author/nils-binder/OoJKHgfwFS-300.jpeg",
    "company": "9elements",
    "slug": "../weekly-nerd/#nils-binder"
  },
  {
    "title": "Tech continues to be political",
    "person": "Miriam Suzanne",
    "category": "speaker",
    "reflection": "Ik vond deze talk in tegenoverstelling tot de talk van Nils Binder die ervoor was erg teleurstellend. Waar ik bij Nils Binder veel geleerd heb, kan ik dat niet zeggen over deze talk. Ik had liever nog een meer technische talk gehad in plaats van dit 'politieke' verhaal. Wel is de missie van W3C een erg goed uitgangspunt en sta ik er ook zeker achter dat het web voor iedereen toegankelijk moet zijn en op elk apparaat.",
    "content": "De missie van W3C is: “Web for all, web on everything” – oftewel een web dat voor iedereen toegankelijk is, op elk apparaat. In de beginjaren van het internet zagen websites er allemaal ongeveer hetzelfde uit, omdat de stijl bepaald werd door de browser en de voorkeuren van de gebruiker. Ontwerpers hadden nauwelijks controle. De kernboodschap van deze talk is dat makers die voorkeuren niet moeten overschrijven en dat je niet moet ontwerpen voor ‘de gemiddelde gebruiker’, maar juist voor een breed scala aan mensen en situaties. Een opvallend citaat was: “Web design will never be a thing,” waarmee bedoeld wordt dat de gebruiker altijd de controle zou moeten houden over hoe een website eruitziet.",
    "image": "https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcS5GYm8vQa1Ed6QWhUEzXWPpxwp-eWvyf4qVFZygJ6Pt6g9yVWG",
    "company": "Unknown",
    "slug": "../weekly-nerd/#miriam-suzanne"
  },
  {
    "title": "WAFS",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Tijdens dit vak heb ik vooral geexperimenteerd met verschillende animaties van GSAP en ik heb daarnaast ook nieuwe effecten uitgeprobeerd, zoals: mix-blend-mode, clip-path animation, dot cursor en een glow die het tegenovergestelde van de cursor positie neemt. Ook heb ik een parallax effect gemaakt met scrolltrigger van GSAP. Dit was een hele leuke opdracht, omdat ik veel heb geleerd over de mogelijkheden van CSS en GSAP.",
    "content": "De opdracht is om een persoonlijke website te ontwerpen en bouwen waarmee je jezelf goed voorstelt. Het idee is dat je niet alleen laat zien wie je bent, maar ook laat zien dat je in staat bent om je eigen startniveau te overstijgen — dus iets maakt dat verder gaat dan wat je eerder kon. Daarnaast moet je jouw doelen voor de minor op de site presenteren. Het hoeft niet in één keer af te zijn: de bedoeling is dat je je site tijdens de minor steeds verder uitbouwt, persoonlijker maakt en er iets echt bijzonders van maakt.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#wafs"
  },
  {
    "title": "Browser Technologies",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Ik vond dit een erg interessante opdracht, omdat ik heb geleerd hoe je robuuste websites kan maken die op elke browser werken. Bijvoorbeeld iets simpels als input type='date' is blijkbaar niet op elk device beschikbaar. Hierin ging het dus ook vooral om progressive enhancement. Je moet dus zorgen dat iedereen de website kan gebruiken en daarna kan je visueel verder gaan met de website. Dit is een goede les voor de toekomst, omdat je niet altijd kan verwachten dat iedereen de nieuwste browser heeft.",
    "content": "Het web is vanaf het begin ontworpen voor iedereen — ongeacht welke hardware, browser, of manier van interactie je gebruikt. Of iemand nou een oude computer heeft met een verouderde browser, of juist een gloednieuwe smartphone met touch screen of een screenreader, jouw website zou overal moeten werken. Deze lessenreeks leert je omgaan met die enorme diversiteit en laat je zien hoe je websites maakt die robuust, interactief én toegankelijk zijn, in elke situatie.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#browser-technologies"
  },
  {
    "title": "CSS To The Rescue",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "In dit vak heb ik heel veel geleerd over CSS mogelijkheden waarvan ik niet eens wist dat het kon. Zoals de CSS animation-timeline. Maar ook nieuwe kleuren zoals oklch, die je kan gebruiken in plaats van rgb of hex. Ook ben ik erachter gekomen dat sommige animaties en styling niet goed samen werken, waardoor het kan zijn dat een animatie niet afspeelt. Dit was een hele leuke opdracht, omdat ik veel heb geleerd over de mogelijkheden van CSS.",
    "content": "In deze vierweekse cursus ga je op ontdekkingstocht in de wereld van CSS. CSS is inmiddels uitgegroeid tot een volwassen en krachtige taal, maar veel nieuwe (of onbekende) mogelijkheden worden nog nauwelijks benut. Sommige onderdelen van de CSS-specificatie krijgen niet de liefde die ze verdienen, andere zijn nog zo nieuw of complex dat we ze nog niet helemaal begrijpen. Het is jouw taak om deze onontdekte CSS-gebieden te verkennen. Je maakt iets innovatiefs, experimenteels en leuks — met alleen vanilla HTML en CSS (dus géén JavaScript, frameworks of preprocessors).",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#css-to-the-rescue"
  },
  {
    "title": "Hackathon",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Ik vond deze opdracht erg leuk, omdar we hier als team een halve week samen aan hebben gewerkt om iets moois neer te zetten en ik heb ook hier veel geleerd. Ik ben ook erg trots op het infinite scroll effecr die ik heb kunnen maken en het eindresultaat van dit project is iets waar ik erg tevreden mee ben. Het zou alleen denk ik wat beter zijn als we iets langer de tijd hadden om dit project te maken. Ik denk dat we dan nog meer toffe dingen hadden kunnen maken.",
    "content": "In deze opdracht ontwerp en bouw je samen met je team in één week een digitale loftuiting — een eerbetoon — aan vrouwen in tech die impact hebben (gehad). Hiervoor gebruik je data uit een API. Het project combineert creativiteit, techniek en samenwerking. Daarnaast is het de bedoeling dat je experimentele technieken toepast (minimaal twee), zodat het eindresultaat ook dient als showcase van wat er mogelijk is met moderne webtechnologieën. De opdracht is verdeeld in twee delen: ontwerpen en bouwen.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#hackathon"
  },
  {
    "title": "API",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Dit is tot nu toe mijn favoriete opdracht. Ik heb veel geleerd over back-end en hoe ik die soepel met de front-end kan laten samenwerken. Daarnaast ben ik ook beter geworden in het opzetten en gebruiken van een database. Ook heb ik hier voor het eerst view-transitions uitgeprobeerd en je kan hiermee hele toffe transities maken. Ik ben erg trots op de chat website die ik heb gemaakt bij dit vak en ik vraag me af hoeveel functionaliteit ik nog had kunnen maken als we een weekje extra gehad zouden hebben..",
    "content": "Het web is een krachtig en open platform, gebouwd op standaarden die samen met de community zijn ontwikkeld. Deze openheid maakt het toegankelijk voor iedereen. Toch proberen grote techbedrijven vaak om deze openheid te ondermijnen door gesloten ecosystemen te bouwen waarin zij alles bepalen — van de ervaring tot de data. In deze vierweekse cursus ga je juist de kracht van het open web ervaren. Je leert hoe je (mobiele) webapps kunt bouwen die qua gebruikservaring niet onderdoen voor native apps. Je begint met een server-side gerenderde app en verbetert deze stapsgewijs met moderne web API's.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#api"
  },
  {
    "title": "Human Centered Design",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Dit vak was erg interessant, vooral omdat we direct met de doelgroep gingen testen. Normaal hou je natuurlijk rekening met een grote doelgroep en wil je inclusive design toepassen, maar voor deze opdracht gebruikten we juist exclusive design en hadden we een specifiek persoon waarvoor de website was. Deze opdracht was erg uniek en leuk.",
    "content": "In dit vak draait alles om ontwerpen voor één specifiek persoon, niet voor 'de gemiddelde gebruiker'. Je leert het web écht inclusief te maken door te ontwerpen op basis van de persoonlijke voorkeuren, gewoontes en identiteit van één testpersoon. Elke week komt er iemand langs met een unieke manier van omgaan met het web. Aan jou de taak om een prototype te ontwerpen dat perfect past bij die ene persoon, gebaseerd op de principes van Exclusive Design: bestudeer de situatie goed, negeer standaardoplossingen als dat nodig is, zet de identiteit van je testpersoon voorop en wees niet bang om wat speelsheid of gekkigheid toe te voegen.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#human-centered-design"
  },
  {
    "title": "Meesterproef",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Ik vond dit het leukste project van de minor. Het leren omgaan met een opdrachtgever, samenwerken in een team en de opdracht zelf die we hadden gekregen waren erg leuk en uitdagend. Ik zou deze opdracht zo nog een paar weken kunnen doen als er nog meer tijd was. Ik heb veel geleerd over samenwerken, back-end en ik ben een stuk beter geworden in taakgericht werken! Aan het begin van het project was ik wat te snel van start gegaan, maar nadat ik het met mijn team het erover heb gehad, ben ik daar denk ik goed mee verder gegaan zodat iedereen aan zijn leerdoelen kon werken. Ik ben ook erg trots op het eindresultaat en ik denk dat we een goede basis hebben neergezet voor de tests van volgend jaar.",
    "content": "Bij de meesterproef kregen ik en mijn team de opdracht om een kennishub te maken voor CMD studenten en docenten, waarin het makkelijk moet zijn om informatie te vinden over CMD Theorie. We hadden in totaal 5 weken voor deze opdracht, waarvan we de eerste 2 weken bezig zijn geweest met research en design en de laatste 3 weken met development bezig waren. De doelen die ik had gesteld voor dit project waren: Samenwerken, Back-end en Taakgericht te werk gaan (Zie voor details de goals pagina). Ik begon al meteen met 2 van mijn leerdoelen door een Trello bord te starten. Deze heb ik ook voor het grootste gedeelte bijgehouden gedurende het hele project. Dit hielp mij om taakgericht te werk te gaan, want ik deed steeds een taak per keer en pas als ik klaar was dan ging ik aan de slag met iets nieuws.  Dit is zeker iets wat ik vanaf nu zal doen bij projecten, omdat ik merkte dat de kwaliteit van mijn code ook een stuk beter werd en mijn planning ook meer volgens plan ging. Voor de rest hebben we met het team alles gecommuniceerd, of dit nou ging om aanwezigheid, vragen of feedback. Daarnaast hebben we ook afspraken gemaakt over hoe we committen, branch names etc. om merge conflicts te voorkomen en we hebben ook altijd een code review gedaan voordat deze gecommit werd. Ook hadden we per week in Trello aangegeven wat we die week af wouden hebben. Hierdoor konden we uiteindelijk alles op tijd afhebben en ging het samenwerken hier dus ook een stuk beter dan bij de hackathon. Ook ben ik erg veel bezig geweest met de back-end. Ik heb voor alle pagina's de data opgehaald en voor de meeste pagina's en componenten ook gezorgd dat deze data erin kwam. Ook heb ik de zoekfunctionaliteit gemaakt wat ook in de back-end gebeurd. Bekijk voor de productbiografie en complete reflectie op de meesterproef pagina.",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "Ronald Merkuur",
    "slug": "../weekly-nerd/#meesterproef"
  },
  {
    "title": "Web Design & Development",
    "person": "Jamie Tirbeni",
    "category": "assignment",
    "reflection": "Ik vond deze minor ontzettend leuk en leerzaam. Ik heb veel nieuwe kennis opgedaan, vooral op het gebied van HTML en CSS, inclusief moderne en experimentele technieken die ik hiervoor nog niet kende. Ik ben blij dat ik voor deze minor heb gekozen, omdat ik echt het gevoel heb dat ik ben gegroeid. Niet alleen in mijn technische vaardigheden, maar ook in samenwerken binnen een team en het taakgericht aanpakken van projecten. De gastsprekers en docenten hebben me veel waardevolle inzichten gegeven. Eén van de dingen die me het meest is bijgebleven is het principe van 'the rule of least power', iets waar ik zeker bewuster mee om zal gaan in mijn toekomstige werk. De opdrachten binnen de minor waren heel verschillend van elkaar, wat zorgde voor afwisseling en steeds weer nieuwe uitdagingen. Dit gaf mij ook de kans om de vaardigheden die ik per vak opdeed meteen toe te passen. Het vak dat ik het leukst vond was API, omdat ik hier kon werken aan de back-end. Dat is een richting waarin ik me graag verder wil verdiepen. Toch waren CSS To The Rescue en Browser Technologies voor mij het meest interessant als het gaat om de theorie. Deze vakken hebben me laten zien hoe krachtig CSS eigenlijk is en hoe je een toegankelijke, functionele website kunt maken die werkt op verschillende browsers. Ik kijk met veel plezier terug op deze minor. Ik heb niet alleen mijn technische kennis uitgebreid, maar ook geleerd hoe belangrijk samenwerking, toegankelijkheid en doordacht ontwerp zijn. Deze ervaring neem ik mee in mijn verdere studie en carrière. Het was een waardevolle stap in mijn ontwikkeling als developer.",
    "content": "In deze minor zijn we bezig geweest met verschillende technieken en onderwerpen die belangrijk zijn voor web design, maar vooral ook voor web development. De focus lag vooral op front-end development, maar we hebben ook de kans gehad om met back-end bezig te zijn tijdens API en de Meesterproef. We hebben geleerd over onderwerpen zoals toegankelijkheid, CSS, JavaScript, API's, Progressive Enhancement en natuurlijk een heleboel weekly nerds!",
    "image": "../assets/images/wdnd-banner.jpeg",
    "company": "HvA",
    "slug": "../weekly-nerd/#web-design-development"
  }
]
